Terraform Plan for terraform/eus/dev/backend_asa:

```
data.azurerm_key_vault.vault: Reading...
data.azurerm_postgresql_flexible_server.ops_dbs: Reading...
data.azurerm_storage_account.static_fe: Reading...
data.azurerm_container_app_environment.aca_env: Reading...
data.azurerm_key_vault.vault: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.KeyVault/vaults/opre-ops-dev-eus-core-kv]
data.azurerm_key_vault_secret.ops-pw: Reading...
data.azurerm_key_vault_secret.ops-jwt-private-key: Reading...
data.azurerm_postgresql_flexible_server.ops_dbs: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opre-ops-dev-eus-db-psql]
data.azurerm_storage_account.static_fe: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.Storage/storageAccounts/opreopsdeveussfest]
data.azurerm_container_app_environment.aca_env: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae]
data.azurerm_key_vault_secret.ops-pw: Read complete after 1s [id=https://opre-ops-dev-eus-core-kv.vault.azure.net/secrets/ops-role-password/09ab85f39f0f4033bad60333fb584f93]
data.azurerm_key_vault_secret.ops-jwt-private-key: Read complete after 1s [id=https://opre-ops-dev-eus-core-kv.vault.azure.net/secrets/ops-jwt-private-key/f4cec3a063e24ab1aba6dd83c63fbc0a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.backend will be created
  + resource "azurerm_container_app" "backend" {
      + container_app_environment_id  = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "opre-ops-dev-eus-sbe-ca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "opre-ops-dev-eus-core-rg"
      + revision_mode                 = "Multiple"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 1
          + revision_suffix = "4e31e245"

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/hhs/opre-ops/ops-backend:4e31e245d365cc134506ff91a15bd68054f3de8f"
              + memory            = "0.5Gi"
              + name              = "ops-backend"

              + env {
                  + name  = "OPS_CONFIG"
                  + value = "environment/azure/dev.py"
                }
              + env {
                  + name  = "PGUSER"
                  + value = "ops"
                }
              + env {
                  + name        = "PGPASSWORD"
                  + secret_name = "pgpassword"
                }
              + env {
                  + name  = "PGHOST"
                  + value = "opre-ops-dev-eus-db-psql.postgres.database.azure.com"
                }
              + env {
                  + name  = "PGPORT"
                  + value = "5432"
                }
              + env {
                  + name  = "PGDATABASE"
                  + value = "postgres"
                }
              + env {
                  + name        = "JWT_PRIVATE_KEY"
                  + secret_name = "jwt-private-key"
                }
              + env {
                  + name  = "OPS_FRONTEND_URL"
                  + value = "https://opreopsdeveussfest.z13.web.core.windows.net"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Plan saved to GH artifacts.